# apply() 함수

- apply()함수 사용법

1. df.apply(func, axis=0, raw = False, result"_type = None, args=(), kwargs)
2. function() : 각 행이나 열에 적용할 함수 입니다.
3. axis : {0:columns / 1:index} 함수를 적용할 축입니다.
4. raw : {True : ndarray / False : Series} 함수에 전달할 축의 형식입니다. Defualt는 Series입니다.
5. result_type : {expand/reduce/broadcase} 반환값의 형태를 결정합니다.  
    expand : 배열 형태를 기준으로 열을 확장합니다.(기본 인덱스로)  
    reduce : series 형태로 반환합니다.  
    broadcase : 기존 열 형식대로 확장하여 반환합니다.(열의 수가 같아야합니다.)  
6. 기존 컬럼을 가공하여 새로운 컬럼을 추가하는 경우

In [7]:
import numpy as np
import pandas as pd

df = pd.DataFrame([[4, 9], [1, 4], [5, 6]], columns=['A', 'B'])

df

   A  B
0  4  9
1  1  4
2  5  6

In [8]:
# 열기준 합
df.apply(np.sum, axis=0)

A    10
B    19
dtype: int64

In [9]:
#행기준 합
df.apply(np.sum, axis=1)

0    13
1     5
2    11
dtype: int64

In [12]:
def plus_one(x):
    x += 1
    return x

df['A'] = df['A'].apply(plus_one)
df

   A  B
0  5  9
1  2  4
2  6  6

In [14]:
dict_item = {
    'item_id' : [1,2,3,4],
    'item_price' : ['a', 'b', 'c', 'd'],
    'price' : [1000, 2000, 3000, 4000]
}

df_item = pd.DataFrame(dict_item)

df_item

   item_id item_price  price
0        1          a   1000
1        2          b   2000
2        3          c   3000
3        4          d   4000

In [16]:
# 기존 price칼럼에 2를 곱해서 새로운 price2 컬럼을 생성
# apply()함수에서 axis = 1은 람다함수를 적용할 때 세로 방향으로 내려오면서 적용하라는 뜻

df_item['price2'] = df_item.apply(lambda x : x['price'] * 2, axis=1)
print(df_item)
print()

df_item = df_item.apply(lambda x : print(x), axis = 1)

   item_id item_price  price  price2
0        1          a   1000    2000
1        2          b   2000    4000
2        3          c   3000    6000
3        4          d   4000    8000

item_id          1
item_price       a
price         1000
price2        2000
Name: 0, dtype: object
item_id          2
item_price       b
price         2000
price2        4000
Name: 1, dtype: object
item_id          3
item_price       c
price         3000
price2        6000
Name: 2, dtype: object
item_id          4
item_price       d
price         4000
price2        8000
Name: 3, dtype: object

 - 기존 카드 거래 내역 불러오기

In [ ]:
import pandas as pd
import os
import csv

filePath = './card.csv'